package com.pxy.studyhelper.utils;

/**
 * User: Pxy(15602269883@163.com)
 * Date: 2016-02-03
 * Time: 20:14
 * FIXME
 */
public class Constant {

    //这是Bmob的ApplicationId,用于初始化操作
    public static String applicationId = "b6df61fc2e46b2ba781525d42e8b318a";

    public static final String RECEIVER_DOWNLOAD="com.pxy.download";

    public static final String[]  TEST_BIG_SORT={"中医基础理论","中医诊断学","中药学","方剂学","中医内科学","针灸学"};

    public static final String[][]  TEST_SORTS={{"中医理论体系的主要特点","阴阳五行学说","五脏六腑","精气、血、津液、神","经络体质","病因和发病","病机","防治和养生"}
            ,{"绪论","望诊","望舌","问诊","问诊","闻诊","脉诊","按诊","八纲辨证","病因辩证","气血津液辩证","脏腑辩证","六经辩证","卫生营养辩证","三焦辩证"}
            ,{"中药学","中药的性能","中药的作用与用法","解表药","清热药","泻下药","祛风湿药","化湿药","利水渗湿药","温里药","温气药","消食药","驱虫药","止血药","活血化瘀药","化痰止咳平喘药","安神药","平肝息风药","开窍药","补虚药","收泻药","攻毒杀虫止痒药","拔毒化腐蚀生肌药"}
            ,{"方剂总论","常用中药方剂1","常用中药方剂1","常用中药方剂2","常用中药方剂3","常用中药方剂4"}
            ,{"中医内科学","呼吸系统疾病","循环系统疾病","消化系统疾病","泌尿系统疾病","血液及造血系统疾病","内分泌代谢疾病","风湿性与神经系统疾病","肺系、心系、脾系、肝系和肾系疾病","气血津液病症","肢体经络病症","理化因素所致疾病和内科常见危重症"}
            ,{"针灸学","经络系统与治疗总论","特定穴与奇穴","各类针法","各类病症的针灸治疗"}};


    //    public static final String[] level={"幼儿园","小学","初中","高中","本科生","研究生","硕士生","博士生","博士后","学神"};
    public static final String[] level={"初入江湖","学民","学神","学霸","学魔","研究生","硕士生","博士生","博士后","天下无敌"};


}  
